# -*- coding: utf-8 -*-

# Игра «Быки и коровы»
# https://goo.gl/Go2mb9
#
# Правила:
# Компьютер загадывает четырехзначное число, все цифры которого различны
# (первая цифра числа отлична от нуля). Игроку необходимо разгадать задуманное число.
# Игрок вводит четырехзначное число c неповторяющимися цифрами,
# компьютер сообщают о количестве «быков» и «коров» в названном числе
# «бык» — цифра есть в записи задуманного числа и стоит в той же позиции,
#       что и в задуманном числе
# «корова» — цифра есть в записи задуманного числа, но не стоит в той же позиции,
#       что и в задуманном числе
#
# Например, если задумано число 3275 и названо число 1234,
# получаем в названном числе одного «быка» и одну «корову».
# Очевидно, что число отгадано в том случае, если имеем 4 «быка».
#
# Формат ответа компьютера
# > быки - 1, коровы - 1


# Составить отдельный модуль mastermind_engine, реализующий функциональность игры.
# В этом модуле нужно реализовать функции:
#   загадать_число()
#   проверить_число(NN) - возвращает словарь {'bulls': N, 'cows': N}
# Загаданное число хранить в глобальной переменной.
# Обратите внимание, что строки - это список символов.
#
# В текущем модуле (lesson_006/01_mastermind.py) реализовать логику работы с пользователем:
#   модуль движка загадывает число
#   в цикле, пока число не отгадано
#       у пользователя запрашивается вариант числа
#       модуль движка проверяет число и выдает быков/коров
#       результат быков/коров выводится на консоль
#  когда игрок угадал таки число - показать количество ходов и вопрос "Хотите еще партию?"
#
# При написании кода учитывайте, что движок игры никак не должен взаимодействовать с пользователем.
# Все общение с пользователем делать в текущем модуле. Представьте, что движок игры могут использовать
# разные клиенты - веб, чатбот, приложение, етс - они знают как спрашивать и отвечать пользователю.
# Движок игры реализует только саму функциональность игры.
# Это пример применения SOLID принципа (см https://goo.gl/GFMoaI) в архитектуре программ.
# Точнее, в этом случае важен принцип единственной ответственности - https://goo.gl/rYb3hT

from cow_bull_engine import guess_number, check_number, is_gameover, take_rules, answers, _holder_number

print('Игра "Быки и Коровы".')
player_response = input('Если хотите поиграть введите "да", если хотите прочитать правила введите "правила":\n')

while True:
    guess_number()
    if answers(player_response) == 'rules':
        take_rules()
        player_response = input('Играем?\n')
        if answers(player_response) != 'game':
            break

    if answers(player_response) == 'game':
        while True:
            tmp_number = input('Введите предпологаемое число:\n')

            if answers(tmp_number) == 'game over':
                print('Число то было простое:', _holder_number)
                break
            elif answers(tmp_number) == 'rules':
                take_rules()
                tmp_number = input('Введите предпологаемое число:\n')

            result = check_number(number_str=tmp_number)
            if result:
                print('Коровы - {}, быки - {}'.format(result['cows'], result['bulls']))
            else:
                print('Вы ввели некорректное число!')

            if is_gameover():
                print('Вы отгадали число!')
                break

    player_response = input('Хотите сыграть еще?\n')
    if answers(player_response) != 'game':
        print('Ты молодец!')
        break
